; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v8)
             (pred_7 ?v10 ?v3)
             (pred_1 ?v9 ?v3)
             (pred_8 ?v4 ?v9 )
	     (pred_9 ?v9)
             (pred_12 ?v12)
             (pred_5 ?v10)
             (pred_6 ?v3)
             (pred_10 ?v9)
             (pred_3 ?v10)
             (pred_4 ?v9)
             (pred_2 ))



(:action op_1
:parameters (?v6 ?v2 ?v13 ?v1)
:precondition (and (pred_12 ?v6) (pred_12 ?v2) (pred_5 ?v13) (pred_6 ?v1)
          (pred_11 ?v6 ?v2) (pred_7 ?v13 ?v1)
                   (pred_1 ?v2 ?v1) (pred_9 ?v6) 
                   (pred_10 ?v2) (pred_3 ?v13))
:effect (and  (pred_4 ?v2) (not (pred_10 ?v2))))


(:action op_5
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_12 ?v11)
               (pred_9 ?v6) (pred_11 ?v6 ?v11) (pred_4 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v6))))

(:action op_2
:parameters (?v6 ?v13)
:precondition (and (pred_12 ?v6) (pred_5 ?v13) 
                  (pred_9 ?v6) (pred_8 ?v13 ?v6) (pred_2 ))
:effect (and (pred_3 ?v13)
   (not (pred_8 ?v13 ?v6)) (not (pred_2 ))))


(:action op_3
:parameters (?v6 ?v7 ?v5)
:precondition (and (pred_12 ?v6) (pred_5 ?v7) (pred_5 ?v5)
                  (pred_9 ?v6) (pred_3 ?v5) (pred_8 ?v7 ?v6))
:effect (and (pred_3 ?v7) (pred_8 ?v5 ?v6)
        (not (pred_3 ?v5)) (not (pred_8 ?v7 ?v6))))

(:action op_4
:parameters (?v6 ?v13)
:precondition (and (pred_12 ?v6) (pred_5 ?v13) 
                  (pred_9 ?v6) (pred_3 ?v13))
:effect (and (pred_2 ) (pred_8 ?v13 ?v6) (not (pred_3 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_19 obj_25 obj_24 obj_21 obj_02 obj_26 obj_03 obj_16 obj_20 obj_23 obj_11 obj_10 obj_31 obj_09 obj_13 obj_12 obj_01 obj_29 obj_06 obj_22 obj_04 obj_14 obj_15 obj_30 obj_08
    obj_18 obj_05 obj_17
    obj_27 obj_07 obj_32 obj_28
    )

    (:init
       (pred_2)

       (pred_12 obj_19)
       (pred_12 obj_25)
       (pred_12 obj_24)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_23)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_31)
       (pred_12 obj_09)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_06)
       (pred_12 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_30)
       (pred_12 obj_08)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_5 obj_27)
       (pred_5 obj_07)
       (pred_5 obj_32)
       (pred_5 obj_28)

       (pred_11 obj_19 obj_26)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_25 obj_03)
       (pred_11 obj_25 obj_24)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_24 obj_16)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_25)
       (pred_11 obj_21 obj_20)
       (pred_11 obj_21 obj_02)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_02 obj_21)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_03)
       (pred_11 obj_26 obj_19)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_25)
       (pred_11 obj_03 obj_26)
       (pred_11 obj_16 obj_31)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_24)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_20 obj_21)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_23 obj_13)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_31 obj_09)
       (pred_11 obj_31 obj_16)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_09 obj_13)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_31)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_13 obj_23)
       (pred_11 obj_13 obj_09)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_29 obj_15)
       (pred_11 obj_29 obj_06)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_29)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_04 obj_14)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_04)
       (pred_11 obj_15 obj_30)
       (pred_11 obj_15 obj_29)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_30 obj_15)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_30)
       (pred_10 obj_20)
       (pred_10 obj_22)
       (pred_10 obj_21)
       (pred_10 obj_02)
       (pred_1  obj_20 obj_18)
       (pred_1  obj_22 obj_05)
       (pred_1  obj_21 obj_17)
       (pred_1  obj_02 obj_17)
       (pred_4 obj_19)
       (pred_4 obj_25)
       (pred_4 obj_24)
       (pred_4 obj_26)
       (pred_4 obj_03)
       (pred_4 obj_16)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_31)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_29)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_08)

       (pred_7  obj_27 obj_18)
       (pred_7  obj_07 obj_05)
       (pred_7  obj_32 obj_17)
       (pred_7  obj_28 obj_17)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_32 obj_30)
       (pred_8 obj_28 obj_24)
       (pred_9 obj_06)
    )

    (:goal (and
       (pred_8 obj_28 obj_06)
    ))
(:constraints
  (always (not (pred_9 obj_09)))
)
)

; plan
1. (op_5 obj_06 obj_29)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_29)
   goals met: 0 of 1
2. (op_5 obj_29 obj_31)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_31)
   goals met: 0 of 1
3. (op_5 obj_31 obj_16)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_16)
   goals met: 0 of 1
4. (op_5 obj_16 obj_24)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_24)
   goals met: 0 of 1
5. (op_2 obj_24 obj_28)
   deleted: (pred_8 obj_28 obj_24) (pred_2)
   added: (pred_3 obj_28)
   goals met: 0 of 1
6. (op_5 obj_24 obj_16)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_16)
   goals met: 0 of 1
7. (op_5 obj_16 obj_31)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_31)
   goals met: 0 of 1
8. (op_5 obj_31 obj_29)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_29)
   goals met: 0 of 1
9. (op_5 obj_29 obj_06)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_06)
   goals met: 0 of 1
10. (op_4 obj_06 obj_28)
   deleted: (pred_3 obj_28)
   added: (pred_2) (pred_8 obj_28 obj_06)
   goals met: 1 of 1
